package quiz

var (
	AnswersRepeat = []string{
		"еще раз",
		"ещё раз",
		"снова",
		"повтор",
		"не понял",
		"что",
		"не расслышал",
		"не понял",
	}

	AnswersReturnToRoot = []string{
		"закончи",
		"прекрати",
		"останови",
	}

	AnswersPositional = map[string]int{
		"первый":    0,
		"второй":    1,
		"третий":    2,
		"четвёртый": 3,
		"пятый":     4,
		"один":      0,
		"два":       1,
		"три":       2,
		"четыре":    3,
		"пять":      4,
		"а":         0,
		"б":         1,
		"в":         2,
		"г":         3,
		"д":         4,
	}
)
