package quiz

var (
	AnswersRepeat = []string{
		"еще раз",
		"ещё раз",
		"снова",
		"повтор",
		"не понял",
		"не расслышал",
		"повтори",
		"заново",
	}

	AnswersBackToQuestion = []string{
		"вернись",
		"верни",
		"назад",
		"прошлый",
		"предыдущий",
		"отмени",
		"измени",
		"смени",
	}

	AnswersQuitGame = []string{
		"закончи",
		"прекрати",
		"останови",
	}

	AnswersReturnToFirstQuestion = []string{
		"сначала",
		"заново",
		"первый вопрос",
		"первому вопросу",
		"с первого вопроса",
		"заново тест",
		"тест заново",
	}

	AnswersReturnToRoot = []string{
		"выбрать тему",
		"другая тема",
		"сменить тему",
		"новая тема",
		"выбрать тест",
		"другой тест",
		"сменить тест",
		"новый тест",
		"выход",
		"выйди",
	}

	AnswersPositional = map[string]int{
		"первый":    0,
		"второй":    1,
		"третий":    2,
		"четвертый": 3,
		"пятый":     4,
		"первое":    0,
		"второе":    1,
		"третье":    2,
		"четвёртое": 3,
		"пятое":     4,
		"один":      0,
		"два":       1,
		"три":       2,
		"четыре":    3,
		"пять":      4,
		"а":         0,
		"б":         1,
		"в":         2,
		"г":         3,
		"д":         4,
		"левый":     0,
	}

	AnswersIntTestPositional = map[string]int{
		"предыдущий":    0,
		"первый":        1,
		"второй":        2,
		"третий":        3,
		"четвертый":     4,
		"пятый":         5,
		"шестой":        6,
		"седьмой":       7,
		"восьмой":       8,
		"девятый":       9,
		"десятый":       11,
		"одиннадцатый":  12,
		"двенадцатый":   13,
		"тринадцатый":   14,
		"пятнадцатый":   15,
		"шестнадцатый":  16,
		"семнадцатый":   17,
		"восемнадцатый": 18,
		"один":          1,
		"два":           2,
		"три":           3,
		"четыре":        4,
		"пять":          5,
		"шесть":         6,
		"семь":          7,
		"восемь":        8,
		"девять":        9,
		"десять":        10,
		"одиннадцать":   11,
		"двенадцать":    12,
		"тринадцать":    13,
		"четырнадцать":  14,
		"пятнадцать":    15,
		"шестнадцать":   16,
		"семнадцать":    17,
		"восемнадцать":  18,
	}
)
