package quiz

var (
	AnswersRepeat = []string{
		"еще раз",
		"ещё раз",
		"снова",
		"повтор",
		"не понял",
		"что",
		"не расслышал",
		"повтори",
	}

	AnswersQuitGame = []string{
		"закончи",
		"прекрати",
		"останови",
	}

	AnswersReturnToFirstQuestion = []string{
		"сначала",
		"заново",
		"первый вопрос",
		"первому вопросу",
		"с первого вопроса",
	}

	AnswersReturnToRoot = []string{
		"выбрать тему",
		"другая тема",
		"сменить тему",
		"новая тема",
		"выбрать тест",
		"другой тест",
		"сменить тест",
		"новый тест",
		"выход",
		"выйди",
	}

	AnswersPositional = map[string]int{
		"первый":    0,
		"второй":    1,
		"третий":    2,
		"четвёртый": 3,
		"пятый":     4,
		"первое":    0,
		"второе":    1,
		"третье":    2,
		"четвёртое": 3,
		"пятое":     4,
		"один":      0,
		"два":       1,
		"три":       2,
		"четыре":    3,
		"пять":      4,
		"а":         0,
		"б":         1,
		"в":         2,
		"г":         3,
		"д":         4,
	}
)
