package quiz

var (
	AnswersRepeat = []string{
		"еще раз",
		"ещё раз",
		"снова",
		"повтор",
		"не понял",
	}

	AnswersPositional = map[string]int{
		"первый":    0,
		"второй":    1,
		"третий":    2,
		"четвёртый": 3,
		"пятый":     4,
		"один":      0,
		"два":       1,
		"три":       2,
		"четыре":    3,
		"пять":      4,
		"А":         0,
		"Б":         1,
		"В":         2,
		"Г":         3,
		"Д":         4,
	}

	AnswersPositionalInfixes = []string{
		"вариант",
		"ответ",
		"ответа",
		"номер",
	}
)
